Revit 2024 API
FamilyThermalProperties Constructor
 Constructs a new FamilyThermalProperties with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public FamilyThermalProperties()
Visual Basic
Public Sub New
Visual C++
public:
FamilyThermalProperties()
See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace